Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/children_and_young_offenders/family_conferences.html.txt.tmx
Source language: en
Languages: ga

source: For the purpose of criminal law a child is anyone under 18 years of age
ga: Ar mhaithe le dlí coiriúil, leanbh aon duine faoi 18 mbliana d’aois

source: Children who have not reached the age of 12 years cannot be charged with an offence, with the exception of children aged 10 or 11 who may be charged with certain serious offences
ga: Ní féidir leanaí nár shlánaigh aois 12 bhliain a chúiseamh i gcion, seachas leanaí 10 nó 11 bhliain d’aois, ar féidir iad siúd a chúiseamh i gcionta áirithe tromchúiseacha

source: During the court proceedings of a child charged with an offence, the court may order that a family conference be held
ga: Le linn na n-imeachtaí cúirte lena mbaineann leanbh a cúisíodh i gcion, féadfaidh an chúirt a ordú go gcuirtear comhdháil teaghlaigh ar bun

source: A family conference is a meeting involving the child charged with the offence, members of the child’s family, the victim(s) and other relevant people
ga: Cruinniú atá i gceist le comhdháil teaghlaigh ina mbíonn an leanbh a cuísíodh sa chion, muintir an linbh, an t-íospartach/na híospartaigh agus daoine eile ábhartha páirteach

source: At the meeting, the offence is discussed with regard to its effect on the victim, the community and on the child’s family
ga: Ag an gcruinniú, pléitear an chion i dtaobh an tionchair a bhí aici ar an íospartach, ar an bpobal agus ar theaghlach an linbh

source: It aims to come up with a plan which will help the child to avoid getting into trouble in the future
ga: Bíonn sé ina chuspóir plean a chruthú a chabhróidh leis an leanbh trioblóid a sheachaint amach anseo

source: The hearings for all minor offences are held in the Children Court, as are most serious (indictable) offences
ga: Bíonn na héisteachtaí do na mionchionta uile ar siúl sa Chúirt Leanaí, mar aon leis na cionta (indíotáilte) is tromchúisí

source: The court may, during the child’s court proceedings, direct that a family conference be convened
ga: Féadfaidh an Chúirt, le linn na n-imeachtaí sa Chúirt Leanaí, a ordú go dtionóiltear comhdháil teaghlaigh

source: The Children Acts 2001–2015 make provision for the court to ask the Probation Service to convene such a family conference
ga: Foráiltear in na hAchtanna Leanaí 2001-2015 gur féidir leis an gCúirt iarraidh ar an tSeirbhís Promhaidh comhdháil teaghlaigh a thionól

source: The court then adjourns the court proceedings until after the conference is held
ga: Déanann an Chúirt imeachtaí na Cúirte a chur ar athló go dtí go mbíonn an chomhdháil tar éis bheith ar siúl

source: The court may direct the conference to consider certain matters relating to the child
ga: Féadfaidh an Chúirt a ordú go mbreithníonn an chomhdháil ar ábhair áirithe lena mbaineann an leanbh

source: The Court orders a family conference when:
ga: Ordaíonn an Chúirt comhdháil teaghlaigh sna cásanna a leanas:

source: • The child accepts responsibility for his/her criminal behaviour
ga: • Glacann an leanbh le freagracht as a (h)iompar coiriúil

source: • The court believes that an action plan should be devised
ga: • Creideann an Chúirt gur cheart plean gníomhaíochta a chur i dtoll a chéile

source: • The child and the child’s parents or guardians agree to participate in the conference
ga: • Comhaontaíonn an leanbh agus tuismitheoirí an linbh chun páirt a ghlacadh sa chomhdháil

source: A probation officer arranges the family conference within 28 days of being requested to do so by the court
ga: Socraíonn oifigeach promhaidh an chomhdháil teaghlaigh laistigh de 28 lá tar éis gur iarr an Chúirt air/uirthi amhlaidh a dhéanamh

source: The child and the child’s family attend the meeting
ga: Freastalaíonn an leanbh agus teaghlach an linbh ar an gcruinniú

source: The victim may attend
ga: Féadfaidh an t-íospartach freastal

source: Other relevant people may also attend, such as a teacher or social worker
ga: Ina theannta sin, féadfaidh daoine ábhartha eile freastal, ar nós múinteora nó oibrí sóisialta

source: At the meeting the child’s offence is discussed with regard to its effect on the victim, the community and on the child’s family
ga: Ag an gcruinniú, pléitear cion an linbh i dtaobh an tionchair a bhí aici ar an íospartach, ar an bpobal agus ar theaghlach an linbh

source: It looks at ways that the child can take responsibility for his/her behaviour and make good the harm done
ga: Caitear súil ar bhealaí is féidir leis an leanbh freagracht a ghlacadh dá (h)iompar agus an díobháil a rinneadh a mhaithiú

source: It is based on the principles of restorative justice
ga: Bunaítear é ar phrionsabail an cheartais aisiríoch

source: At some stage during the meeting, the child and his/her family meet privately to draft an action plan that is designed to make amends and to help the child stay out of trouble
ga: Ag céim áirithe le linn an chruinnithe, casann an leanbh agus a t(h)eaghlach go príobháideach le plean gníomhaíochta a dhréachtú a cruthaíodh le réiteach a bhaint amach agus le cabhrú leis an leanbh trioblóid a sheachaint

source: The draft action plan is then discussed by the full group at the meeting and agreed
ga: Ansin pléann an grúpa iomlán an dréachtphlean gníomhaíochta ag an gcruinniú agus déantar comhaontú air

source: The agreed action plan is submitted to court for approval
ga: Cuirtear an plean comhaontaithe gníomhaíochta faoi bhráid na Cúirte lena faomhadh a fháil

source: If the court approves the plan it is overseen by the child’s family, other identified individuals and it is supervised by the probation officer
ga: Má thugann an Chúirt faomhadh don phlean, déanfaidh teaghlach an linbh, daoine eile a shainaithnítear agus an t-oifigeach promhaidh é a mhaoirsiú

source: When the action plan has been completed, the case is returned to court for a final decision
ga: Nuair a bhíonn an plean gníomhaíochta tugtha chun críche, tugtar an cás ar ais chun na Cúirte chun cinneadh deiridh a dhéanamh air

source: If the action plan is not completed the court can deal with the case in some other way, for example detention or community sanctions
ga: Mura bhfuil an plean gníomhaíochta tugtha chun críche, is féidir leis an gCúirt deileáil leis an gcás ar bhealach éigin eile, mar shampla coinneáil nó smachtbhannaí pobail

source: Further information is available on the Probation Service website
ga: Tá fáil ar thuilleadh faisnéise ar láithreán gréasáin na Seirbhíse Promhaidh
